{
	"name": "Unanswered",
	"namespace": "DE\\RUB\\UnansweredExternalModule",
	"description": "A REDCap external module that supports data completeness by identifying and responding to unanswered fields in real time.",
	"documentation": "README.md",
	"authors": [
		{
			"name": "Günther Rezniczek",
			"email": "guenther.rezniczek@rub.de",
			"institution": "St. Elisabethgruppe GmbH - Marien Hospital Herne | Klinikum der Ruhr-Universität Bochum"
		}
	],
	"framework-version": 16,
	"action-tags": [
		{
			"tag": "@N-UNANSWERED",
			"description": "Counts how many fields on a form or survey page are currently unanswered and writes the result into the field it is attached to. The field must be a <i>Text Box</i> with <i>Integer</i> validation. By default, all fields are considered unless a comma-separated list of field names or <code>*</code> (to include all required fields) is provided as a parameter. <i>For details, please refer to the module's documentation.</i>"
		},
		{
			"tag": "@N-UNANSWERED-EXCLUDED",
			"description": "Prevents the field it is attached to from being included in a <code>@N-UNANSWERED</code> count. Optionally, you can specify one or more target counter fields as a parameter to exclude this field only from those specific counts. If added to the same field as the counter, the parameter should be a comma-separated list of field names to exclude. <i>For details, please refer to the module's documentation.</i>"
		},
		{
			"tag": "@N-UNANSWERED-ALWAYS-INCLUDED",
			"description": "Can be applied to, e.g., checkbox fields (which are otherwise not counted), or to fields that are embedded in, e.g., a radio or checkbox label, in which case it will be included in the <code>@N-UNANSWERED</code> count, even if its parent radio/checkbox is not selected (the default behavior is that embedded fields are only counted when the parent radio/checkbox is checked). You can supply the target counter field as a parameter or use it directly on the same field as the counter. <i>For details, please refer to the module's documentation.</i>"
		},
		{
			"tag": "@N-UNANSWERED-DIALOG",
			"description": "Displays a customizable dialog when the user attempts to save a form or survey page with unanswered fields, based on a threshold count. This tag must be used together with <code>@N-UNANSWERED</code> on the same field. Optional parameters allow you to specify a custom content field for the dialog, set a minimum unanswered count threshold, and suppress the dialog for <i>Save & Stay</i> via the <code>NSS</code> flag. <i>For details, please refer to the module's documentation.</i>"
		},
		{
			"tag": "@N-UNANSWERED-HIGHLIGHT-WITH-DIALOG",
			"description": "Highlights unanswered fields on the form, but only after a dialog triggered by <code>@N-UNANSWERED-DIALOG</code> has appeared. Use this tag on the same field as the counter. You can optionally define the highlight color using any valid CSS color value. <i>For details, please refer to the module's documentation.</i>"
		},
		{
			"tag": "@N-UNANSWERED-HIGHLIGHT-PROGRESSIVE",
			"description": "Highlights all unanswered fields above the most recently edited field, creating a progressive effect as users work through the form. This tag must be used on the same field as <code>@N-UNANSWERED</code>, and optionally accepts a CSS color value for customization. <i>For details, please refer to the module's documentation.</i>"
		}
	],
	"project-settings": [
		{
			"key": "javascript-debug",
			"name": "Output debug information to the browser console",
			"type": "checkbox"
		}
	]
}