{
    "name": "Unanswered",
    "namespace": "DE\\RUB\\UnansweredExternalModule",
    "description": "REDCap external module that counts the unanswered fields on a data entry or survey page.",
    "documentation": "README.md",
    "authors": [
        {
            "name": "Günther Rezniczek",
            "email": "guenther.rezniczek@rub.de",
            "institution": "Marien Hospital Herne, Klinikum der Ruhr-Universität Bochum"
        }
    ],
    "framework-version": 16,
    "action-tags": [
        {
            "tag": "@N-UNANSWERED",
            "description": "Counts the unanswered fields on a data entry or survey page. This action tag must be attached to a field of type 'Text Box' with validation set to 'Integer' only. The behavior of fields with regard to this action tag can be modified with the <code>@N-UNANSWERED-EXCLUDED</code> and <code>@N-UNANSWERED-ALWAYS-INCLUDED</code> action tags. Optionally, a set of fields (separated by a comma) can be specified as a parameter to limit the count to this set. For example, <code>@N-UNANSWERED='field1,field2,field3'</code> will only consider the fields <code>field1</code>, <code>field2</code>, and <code>field3</code>. Additionally, when a field in the parameter list is prepended with <code>__</code> (double underscore), all fields of the section this field is in will be added. This is useful to create a counting behavior that is the same for an instrument both, in data entry mode as well as in survey mode when showing one page per section."
        },
        {
            "tag": "@N-UNANSWERED-EXCLUDED",
            "description": "Attach this action to any field you do not want to be counted by the <code>@N-UNANSWERED</code> action tag. If there are multiple fields on a form or survey page and you want to exclude a field from a specific instance of <code>@N-UNANSWERED</code>, then supply the corresponding field name as a string parameter to the action tag (e.g., <code>@N-UNANSWERED-EXCLUDED='counter'</code>, where <i>counter</i> is the field with the <code>@N-UNANSWERED</code> action tag. Alternatively, this action tag may be added to the same field as the <code>@N-UNANSWERED</code> action tag, in which case the list of fields to be excluded should be supplied as a comma-separated list in the string parameter of this action tag."
        },
        {
            "tag": "@N-UNANSWERED-ALWAYS-INCLUDED",
            "description": "Attach this action to any field that is embedded in the label of a radio or checkbox field to included in the count even when the radio or checkbox it is embedded in is not selected/checked. Such fields are otherwise only counted by the <code>@N-UNANSWERED</code> action tag when the embedding radio/checkbox is selected/checked. To associated this action tag with a specific instance of <code>@N-UNANSWERED</code>, supply the corresponding field name as a string parameter to the action tag. Alternatively, this action tag may be added to the same field as the <code>@N-UNANSWERED</code> action tag, in which case the list of fields to be excluded should be supplied as a comma-separated list in the string parameter of this action tag."
        },
        {
            "tag": "@N-UNANSWERED-HIGHLIGHT-PROGRESSIVE",
            "description": "Attach this action together with the <code>@N-UNANSWERED</code> action tag only, i.e., to the same field. When set, unanswered fields will be progressively highlighted in red or the color specified as an optional parameter to this actiontag (e.g., <code>@N-UNANSWERED-HIGHLIGHT-PROGRESSIVE='orange'</code>). The color value can be any valid CSS color value, e.g., <code>red</code>, <code>#ff0000</code>, or <code>rgb(255, 0, 0)</code>. Progressive highlighting means that any unanswered fields <i>above</i> the last edited field will be hightlighted."
        },
        {
            "tag": "@N-UNANSWERED-HIGHLIGHT-AFTER-DIALOG",
            "description": "Attach this action together with the <code>@N-UNANSWERED</code> action tag only, i.e., to the same field. When set, unanswered fields will be highlighted, but only after a dialog has been opened in response to the user or survey respondent saving the current page (but not when going back on a survey). The default highlight color is red, but can be specified as an optional parameter to this actiontag (e.g., <code>@N-UNANSWERED-HIGHLIGHT-AFTER-DIALOG='orange'</code>). The color value can be any valid CSS color value, e.g., <code>red</code>, <code>#ff0000</code>, or <code>rgb(255, 0, 0)</code>."
        },
        {
            "tag": "@N-UNANSWERED-DIALOG",
            "description": "Attach this action together with the <code>@N-UNANSWERED</code> action tag only, i.e., to the same field. When set, the label of the current field will be shown as a dialog when the user or survey respondent tries to save the page with unanswered questions (i.e., the count being > 0). The following optional parameters can be added: (1) The name of another field (e.g., a descriptive field) can be given, in which case that field's label will serve as the dialog's content. (2) A threshold value for the unanswered count that must be reached for the dialog to show. This must be an integer value. When both, a field name and a threshold are to be set, the field must be named first and the threshold must follow after a comma. The default threshold is 1. Examples: <code>@N-UNANSWERED-DIALOG='3'</code>, <code>@N-UNANSWERED-DIALOG='desc_dialog,3'</code>.<br><br>The dialog shown can be customized to some extent. By default, the title will be 'Alert' and the buttons will be labeled 'Cancel' and what the original save/continue button was labeled. To customize the dialog title and the button labels, these elements can be added to the label, wrapped in double curly braces, i.e., <b>{{type:content}}</b>, where <i>type</i> is <code>title</code>, <code>cancel</code>, or <code>continue</code>, and <i>content</i> is the desired content. Care must be taken to not have any formatting obscure the start (<b>{{type:</b>) and end (<b>}}</b>) of these elements as else they may not be picked up correctly. It is best to not use the Rich Text Editor or to turn it off to inspect the underlying HTML. Some limited formatting of the contents itself is supported.<br>Note: The field used as the dialog's source will be hidden; and it cannot be embedded elsewhere."
        }
    ],
    "system-settings": [
    ],
    "project-settings": [
        {
            "key": "javascript-debug",
            "name": "Output debug information to the browser console",
            "type": "checkbox"
        }
    ]
}